{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "displayName": "Win - OIB - Compliance - U - Defender for Endpoint - v3.1",
  "description": null,
  "roleScopeTagIds": ["0"],

  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,

  "requireHealthyDeviceReport": false,

  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,

  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": false,
  "secureBootEnabled": false,
  "codeIntegrityEnabled": false,
  "memoryIntegrityEnabled": false,
  "kernelDmaProtectionEnabled": false,
  "virtualizationBasedSecurityEnabled": false,
  "firmwareProtectionEnabled": false,
  "storageRequireEncryption": false,

  "activeFirewallRequired": false,

  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": true,
  "rtpEnabled": true,

  "antivirusRequired": false,
  "antiSpywareRequired": false,

  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",

  "configurationManagerComplianceRequired": false,
  "tpmRequired": false,

  "deviceCompliancePolicyScript": null,

  "validOperatingSystemBuildRanges": []
}
