{
  "deviceCompliancePolicy": {
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "@odata.id": "deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')",
    "@odata.editLink": "deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": ["0"],
    "id": "19214506-43ca-4284-a782-2aad6e8f12d7",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2024-04-10T19:40:27.7210955Z",
    "description": null,
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2024-04-10T19:40:27.7210955Z",
    "displayName": "Win - OIB - Compliance - U - Defender for Endpoint - v3.1",
    "version": 1,
    "passwordRequired": false,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumCharacterSetCount": null,
    "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
    "passwordRequiredType": "deviceDefault",
    "passwordPreviousPasswordBlockCount": null,
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": null,
    "osMaximumVersion": null,
    "mobileOsMinimumVersion": null,
    "mobileOsMaximumVersion": null,
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": false,
    "secureBootEnabled": false,
    "codeIntegrityEnabled": false,
    "memoryIntegrityEnabled": false,
    "kernelDmaProtectionEnabled": false,
    "virtualizationBasedSecurityEnabled": false,
    "firmwareProtectionEnabled": false,
    "storageRequireEncryption": false,
    "activeFirewallRequired": false,
    "defenderEnabled": true,
    "defenderVersion": null,
    "signatureOutOfDate": true,
    "rtpEnabled": true,
    "antivirusRequired": false,
    "antiSpywareRequired": false,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "configurationManagerComplianceRequired": false,
    "tpmRequired": false,
    "deviceCompliancePolicyScript": null,
    "validOperatingSystemBuildRanges@odata.type": "#Collection(microsoft.graph.operatingSystemVersionRange)",
    "validOperatingSystemBuildRanges": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/assignments",
    "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
    "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
    "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
    "scheduledActionsForRule": [
      {
        "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
        "@odata.id": "deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')",
        "@odata.editLink": "deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')",
        "id": "19214506-43ca-4284-a782-2aad6e8f12d7",
        "ruleName": null,
        "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionConfigurations",
        "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionConfigurations/$ref",
        "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionConfigurations",
        "scheduledActionConfigurations": [
          {
            "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
            "@odata.id": "deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionConfigurations('d242132f-29d4-4270-b1a3-96d86d192a77')",
            "@odata.editLink": "deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionsForRule('19214506-43ca-4284-a782-2aad6e8f12d7')/scheduledActionConfigurations('d242132f-29d4-4270-b1a3-96d86d192a77')",
            "id": "d242132f-29d4-4270-b1a3-96d86d192a77",
            "gracePeriodHours": 6,
            "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
            "actionType": "block",
            "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
            "notificationMessageCCList@odata.type": "#Collection(String)",
            "notificationMessageCCList": []
          }
        ]
      }
    ],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
    "#microsoft.graph.assign": {
      "title": "microsoft.graph.assign",
      "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
    },
    "#microsoft.graph.scheduleActionsForRules": {
      "title": "microsoft.graph.scheduleActionsForRules",
      "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('19214506-43ca-4284-a782-2aad6e8f12d7')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
    }
  },
  "deviceConfiguration": {
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
    "@odata.id": "deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')",
    "@odata.editLink": "deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration",
    "id": "b5b1d29c-77ef-4b17-96f9-574179611a63",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2024-12-05T20:19:53.9919803Z",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": ["0"],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2024-12-05T20:19:53.9919803Z",
    "description": null,
    "displayName": "Win - OIB - TP - Health Monitoring - D - Endpoint Analytics - v3.4",
    "version": 1,
    "allowDeviceHealthMonitoring@odata.type": "#microsoft.graph.enablement",
    "allowDeviceHealthMonitoring": "enabled",
    "configDeviceHealthMonitoringScope@odata.type": "#microsoft.graph.windowsHealthMonitoringScope",
    "configDeviceHealthMonitoringScope": "bootPerformance",
    "configDeviceHealthMonitoringCustomScope": null,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/groupAssignments",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.windowsHealthMonitoringConfiguration/userStatusOverview",
    "#microsoft.graph.assign": {
      "title": "microsoft.graph.assign",
      "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
    },
    "#microsoft.graph.assignedAccessMultiModeProfiles": {
      "title": "microsoft.graph.assignedAccessMultiModeProfiles",
      "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
    },
    "#microsoft.graph.windowsPrivacyAccessControls": {
      "title": "microsoft.graph.windowsPrivacyAccessControls",
      "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
    },
    "#microsoft.graph.getOmaSettingPlainTextValue": {
      "title": "microsoft.graph.getOmaSettingPlainTextValue",
      "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('b5b1d29c-77ef-4b17-96f9-574179611a63')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
    }
  }
}
